Repository: lingodotdev/lingo.dev
Catalog: packages/cli/demo/xcode-strings/*/example.strings
Languages: es

# welcome_message
source: Hello, world!
es: ¡Hola, mundo!

# login_button
source: Log In
es: Iniciar sesión

# error_message
source: Something went wrong
es: Algo salió mal

# user_profile_title
source: User Profile
es: Perfil de usuario

# quote_example
source: She said "Hello world!"
es: Ella dijo "¡Hola mundo!"

# newline_example
source: First line Second line
es: Primera línea Segunda línea

# backslash_example
source: Path: C:\Users\Documents
es: Ruta: C:\Users\Documents

# mixed_escapes
source: Quote: " Newline: \n Backslash: \\
es: Cita: " Nueva línea: \n Barra invertida: \\

# tab_example
source: Column1 Column2 Column3
es: Columna1 Columna2 Columna3

# multiline_literal
source: This is line 1 This is line 2 This is line 3
es: Esta es la línea 1 Esta es la línea 2 Esta es la línea 3

# multiline_mixed
source: Start here Indented line End here
es: Comienza aquí Línea con sangría Termina aquí

# multiline_with_quotes
source: He said "Hello" Then she said "Goodbye" The end
es: Él dijo "Hola" Luego ella dijo "Adiós" Fin

# after_comment
source: Value after comment
es: Valor después del comentario

# after_multiline_comment
source: Value after multiline comment
es: Valor después del comentario multilínea

# long_value
source: This is a very long string that contains a lot of text to test how the parser handles longer content without any special characters or escapes just plain text going on and on
es: Esta es una cadena muy larga que contiene mucho texto para probar cómo el analizador maneja contenido más extenso sin caracteres especiales ni escapes, solo texto plano que continúa y continúa

# unicode_example
source: Hello 世界 🌍
es: Hola 世界 🌍

# emoji
source: 👋 Hello! 🎉
es: 👋 ¡Hola! 🎉

# accents
source: Café, naïve, résumé
es: Café, ingenuo, currículum

# many_quotes
source: """Multiple quotes"""
es: """Múltiples comillas"""

# settings_title
source: Settings
es: Configuración

# save_button
source: Save
es: Guardar
